app/Http/Controllers/API/AuthController.php

    public function register(Request $request){
        $validator = Validator::make($request->all(),[
            'name' => 'required|string|max:50',
            'username' => 'required|string|max:255|unique:users',
            'password' => 'required|string'
        ]);

        if($validator->fails()){
            return $this->return_failed($validator->errors());
        }

        $user = User::create([
            'name' => $request->name,
            'username' => $request->username,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `username`, `password`, `updated_at`, `created_at`) values ('manuk', 'manuk', '$2y$10$4HFM8Z49v3nnmMcJV3DJSup.fAzdWoHoVjLyfd4ZrswfIOUp.6jcu', '2022-08-07 06:14:31', '2022-08-07 06:14:31')

    public function login(Request $request)
    {
        // return $request;
        if (!Auth::attempt($request->only('username', 'password')))
        {
            return $this->return_failed('Username atau password salah',[]);
        }

        $user = User::where('username', $request['username'])->firstOrFail();
---
select * from `users` where `username` = 'manuk' limit 1

    public function get_user($username)
    {
        try {
            $user = User::where('username', $username)->firstOrFail();
---
select * from `users` where `username` = 'manuk' limit 1

    public function get_all_user()
    {
        try {
            $user = User::select('*')->orderBy('created_at', 'desc')->get();
---
select * from `users` order by `created_at` desc