app/Http/Controllers/API/MenuController.php

insert into `menu` (`nama_menu`, `jenis`, `kategori_id`, `harga`, `image`, `updated_at`, `created_at`) values ('Pancake Original', 'minuman', '2', '18000', 'b5476ed01e782b742997cea554095ba6.jpg', '2022-08-07 06:12:36', '2022-08-07 06:12:36')
---
    function insert_menu(Request $request){
        // return $request;die;
        $menu = Menu::create($this->get_field_menu_request($request));

select * from `menu` where `menu`.`id` = '2' limit 1
update `menu` set `jenis` = 'Makanan', `harga` = '20000', `image` = '', `menu`.`updated_at` = '2022-08-07 06:01:40' where `id` = 2
select * from `attribute` where (`nama` = 'Kecil' and `menu_id` = 2) limit 1
insert into `attribute` (`nama`, `menu_id`, `harga`, `updated_at`, `created_at`) values ('Kecil', 2, '0', '2022-08-07 06:01:40', '2022-08-07 06:01:40')
---
    function edit_menu($id,Request $request){
        try {
            $menu = Menu::findOrFail($id);
        } catch (\Exception $e) {
            return $this->return_failed('data tidak ada');
        }
        if (!$menu) {
            return $this->return_failed('Menu tidak ada');
        }
        $menu->update($this->get_field_menu_request($request));

        if ($request->attribute) {
            for ($i=0; $i < count($request->attribute) ; $i++) {
                $attribute = $request->attribute[$i];

                $menuAtribut = MenuAtribute::where(['nama' =>$attribute['nama'], 'menu_id' => $menu->id])->first();
                if ($menuAtribut) {
                    $menuAtribut->update([
                        'harga' => $attribute['harga'],
                    ]);
                } else {
                    MenuAtribute::create([
                        'nama' => $attribute['nama'],
                        'menu_id' => $menu->id,
                        'harga' => $attribute['harga'],
                    ]);