app/Http/Controllers/API/PesananController.php

insert into `pesanan` (`nama_pelanggan`, `meja_id`, `no_order`, `updated_at`, `created_at`) values ('makrum', '1', '003', '2022-08-07 08:21:59', '2022-08-07 08:21:59')
---
    function insert_order(Request $request){
        $model = new Pesanan();

        $data = $this->get_field_pesanan_request($request);
        try {
            $data['no_order'] = $model->create_no_pesanan();

select * from `pesanan` where `pesanan`.`id` = '1' limit 1
---
    function insert_order_detail(Request $request)
    {
        try {
            $model = new Pesanan();
            $pesanan = Pesanan::findOrFail($request->pesanan_id);

update `pesanan` set `status` = '2', `pesanan`.`updated_at` = '2022-08-07 08:42:02' where `id` = 1
---
    function update_order($id, Request $request)
    {
        $model = new Pesanan();
        $data = $model->get_field($request);

        try {
            $pesanan = Pesanan::findOrFail($id);

            $pesanan->update($data);