app/Models/Pesanan.php

select * from `pesanan` where cast(created_at as date) = current_date order by `created_at` desc limit 1
---
    function create_no_pesanan()
    {
        $date =  \date('Y-m-d');
        $last_pesanan = DB::table('pesanan')->whereRaw("cast(created_at as date) = current_date")->orderBy('created_at', 'desc')->first();